analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_zero_regs.h
/**
 * @file    afe_adc_zero_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the AFE_ADC_ZERO Peripheral Module.
 * @note    This file is @generated.
 * @ingroup afe_adc_zero_registers
 */

/******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 *
 * Copyright (C) 2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32680_INCLUDE_AFE_ADC_ZERO_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32680_INCLUDE_AFE_ADC_ZERO_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     afe_adc_zero
 * @defgroup    afe_adc_zero_registers AFE_ADC_ZERO_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the AFE_ADC_ZERO Peripheral Module.
 * @details     Analog Front End ADC0 on Stacked Die via SPI
 */

/* Register offsets for module AFE_ADC_ZERO */
/**
 * @ingroup    afe_adc_zero_registers
 * @defgroup   AFE_ADC_ZERO_Register_Offsets Register Offsets
 * @brief      AFE_ADC_ZERO Peripheral Register Offsets from the AFE_ADC_ZERO Base Peripheral Address.
 * @{
 */
#define MXC_R_AFE_ADC_ZERO_PD              ((uint32_t)0x00000001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x0001</tt> */
#define MXC_R_AFE_ADC_ZERO_CONV_START      ((uint32_t)0x00010001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x10001</tt> */
#define MXC_R_AFE_ADC_ZERO_SEQ_START       ((uint32_t)0x00020001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x20001</tt> */
#define MXC_R_AFE_ADC_ZERO_CAL_START       ((uint32_t)0x00030001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x30001</tt> */
#define MXC_R_AFE_ADC_ZERO_GP0_CTRL        ((uint32_t)0x00040001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x40001</tt> */
#define MXC_R_AFE_ADC_ZERO_GP1_CTRL        ((uint32_t)0x00050001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x50001</tt> */
#define MXC_R_AFE_ADC_ZERO_GP_CONV         ((uint32_t)0x00060001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x60001</tt> */
#define MXC_R_AFE_ADC_ZERO_GP_SEQ_ADDR     ((uint32_t)0x00070001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x70001</tt> */
#define MXC_R_AFE_ADC_ZERO_FILTER          ((uint32_t)0x00080001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x80001</tt> */
#define MXC_R_AFE_ADC_ZERO_CTRL            ((uint32_t)0x00090001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x90001</tt> */
#define MXC_R_AFE_ADC_ZERO_SOURCE          ((uint32_t)0x000A0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0xA0001</tt> */
#define MXC_R_AFE_ADC_ZERO_MUX_CTRL0       ((uint32_t)0x000B0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0xB0001</tt> */
#define MXC_R_AFE_ADC_ZERO_MUX_CTRL1       ((uint32_t)0x000C0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0xC0001</tt> */
#define MXC_R_AFE_ADC_ZERO_MUX_CTRL2       ((uint32_t)0x000D0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0xD0001</tt> */
#define MXC_R_AFE_ADC_ZERO_PGA             ((uint32_t)0x000E0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0xE0001</tt> */
#define MXC_R_AFE_ADC_ZERO_WAIT_EXT        ((uint32_t)0x000F0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0xF0001</tt> */
#define MXC_R_AFE_ADC_ZERO_WAIT_START      ((uint32_t)0x00100001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x100001</tt> */
#define MXC_R_AFE_ADC_ZERO_PART_ID         ((uint32_t)0x00110003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x110003</tt> */
#define MXC_R_AFE_ADC_ZERO_SYSC_SEL        ((uint32_t)0x00120003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x120003</tt> */
#define MXC_R_AFE_ADC_ZERO_SYS_OFF_A       ((uint32_t)0x00130003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x130003</tt> */
#define MXC_R_AFE_ADC_ZERO_SYS_OFF_B       ((uint32_t)0x00140003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x140003</tt> */
#define MXC_R_AFE_ADC_ZERO_SYS_GAIN_A      ((uint32_t)0x00150003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x150003</tt> */
#define MXC_R_AFE_ADC_ZERO_SYS_GAIN_B      ((uint32_t)0x00160003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x160003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_OFF        ((uint32_t)0x00170003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x170003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_GAIN_1     ((uint32_t)0x00180003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x180003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_GAIN_2     ((uint32_t)0x00190003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x190003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_GAIN_4     ((uint32_t)0x001A0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x1A0003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_GAIN_8     ((uint32_t)0x001B0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x1B0003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_GAIN_16    ((uint32_t)0x001C0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x1C0003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_GAIN_32    ((uint32_t)0x001D0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x1D0003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_GAIN_64    ((uint32_t)0x001E0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x1E0003</tt> */
#define MXC_R_AFE_ADC_ZERO_SELF_GAIN_128   ((uint32_t)0x001F0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x1F0003</tt> */
#define MXC_R_AFE_ADC_ZERO_LTHRESH0        ((uint32_t)0x00200003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x200003</tt> */
#define MXC_R_AFE_ADC_ZERO_LTHRESH1        ((uint32_t)0x00210003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x210003</tt> */
#define MXC_R_AFE_ADC_ZERO_LTHRESH2        ((uint32_t)0x00220003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x220003</tt> */
#define MXC_R_AFE_ADC_ZERO_LTHRESH3        ((uint32_t)0x00230003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x230003</tt> */
#define MXC_R_AFE_ADC_ZERO_LTHRESH4        ((uint32_t)0x00240003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x240003</tt> */
#define MXC_R_AFE_ADC_ZERO_LTHRESH5        ((uint32_t)0x00250003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x250003</tt> */
#define MXC_R_AFE_ADC_ZERO_LTHRESH6        ((uint32_t)0x00260003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x260003</tt> */
#define MXC_R_AFE_ADC_ZERO_LTHRESH7        ((uint32_t)0x00270003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x270003</tt> */
#define MXC_R_AFE_ADC_ZERO_UTHRESH0        ((uint32_t)0x00280003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x280003</tt> */
#define MXC_R_AFE_ADC_ZERO_UTHRESH1        ((uint32_t)0x00290003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x290003</tt> */
#define MXC_R_AFE_ADC_ZERO_UTHRESH2        ((uint32_t)0x002A0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x2A0003</tt> */
#define MXC_R_AFE_ADC_ZERO_UTHRESH3        ((uint32_t)0x002B0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x2B0003</tt> */
#define MXC_R_AFE_ADC_ZERO_UTHRESH4        ((uint32_t)0x002C0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x2C0003</tt> */
#define MXC_R_AFE_ADC_ZERO_UTHRESH5        ((uint32_t)0x002D0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x2D0003</tt> */
#define MXC_R_AFE_ADC_ZERO_UTHRESH6        ((uint32_t)0x002E0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x2E0003</tt> */
#define MXC_R_AFE_ADC_ZERO_UTHRESH7        ((uint32_t)0x002F0003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x2F0003</tt> */
#define MXC_R_AFE_ADC_ZERO_DATA0           ((uint32_t)0x00300003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x300003</tt> */
#define MXC_R_AFE_ADC_ZERO_DATA1           ((uint32_t)0x00310003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x310003</tt> */
#define MXC_R_AFE_ADC_ZERO_DATA2           ((uint32_t)0x00320003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x320003</tt> */
#define MXC_R_AFE_ADC_ZERO_DATA3           ((uint32_t)0x00330003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x330003</tt> */
#define MXC_R_AFE_ADC_ZERO_DATA4           ((uint32_t)0x00340003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x340003</tt> */
#define MXC_R_AFE_ADC_ZERO_DATA5           ((uint32_t)0x00350003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x350003</tt> */
#define MXC_R_AFE_ADC_ZERO_DATA6           ((uint32_t)0x00360003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x360003</tt> */
#define MXC_R_AFE_ADC_ZERO_DATA7           ((uint32_t)0x00370003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x370003</tt> */
#define MXC_R_AFE_ADC_ZERO_STATUS          ((uint32_t)0x00380003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x380003</tt> */
#define MXC_R_AFE_ADC_ZERO_STATUS_IE       ((uint32_t)0x00390003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x390003</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_0            ((uint32_t)0x003A0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x3A0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_1            ((uint32_t)0x003B0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x3B0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_2            ((uint32_t)0x003C0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x3C0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_3            ((uint32_t)0x003D0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x3D0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_4            ((uint32_t)0x003E0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x3E0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_5            ((uint32_t)0x003F0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x3F0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_6            ((uint32_t)0x00400002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x400002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_7            ((uint32_t)0x00410002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x410002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_8            ((uint32_t)0x00420002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x420002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_9            ((uint32_t)0x00430002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x430002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_10           ((uint32_t)0x00440002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x440002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_11           ((uint32_t)0x00450002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x450002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_12           ((uint32_t)0x00460002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x460002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_13           ((uint32_t)0x00470002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x470002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_14           ((uint32_t)0x00480002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x480002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_15           ((uint32_t)0x00490002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x490002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_16           ((uint32_t)0x004A0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x4A0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_17           ((uint32_t)0x004B0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x4B0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_18           ((uint32_t)0x004C0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x4C0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_19           ((uint32_t)0x004D0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x4D0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_20           ((uint32_t)0x004E0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x4E0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_21           ((uint32_t)0x004F0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x4F0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_22           ((uint32_t)0x00500002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x500002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_23           ((uint32_t)0x00510002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x510002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_24           ((uint32_t)0x00520002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x520002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_25           ((uint32_t)0x00530002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x530002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_26           ((uint32_t)0x00540002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x540002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_27           ((uint32_t)0x00550002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x550002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_28           ((uint32_t)0x00560002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x560002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_29           ((uint32_t)0x00570002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x570002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_30           ((uint32_t)0x00580002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x580002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_31           ((uint32_t)0x00590002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x590002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_32           ((uint32_t)0x005A0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x5A0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_33           ((uint32_t)0x005B0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x5B0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_34           ((uint32_t)0x005C0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x5C0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_35           ((uint32_t)0x005D0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x5D0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_36           ((uint32_t)0x005E0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x5E0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_37           ((uint32_t)0x005F0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x5F0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_38           ((uint32_t)0x00600002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x600002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_39           ((uint32_t)0x00610002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x610002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_40           ((uint32_t)0x00620002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x620002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_41           ((uint32_t)0x00630002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x630002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_42           ((uint32_t)0x00640002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x640002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_43           ((uint32_t)0x00650002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x650002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_44           ((uint32_t)0x00660002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x660002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_45           ((uint32_t)0x00670002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x670002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_46           ((uint32_t)0x00680002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x680002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_47           ((uint32_t)0x00690002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x690002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_48           ((uint32_t)0x006A0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x6A0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_49           ((uint32_t)0x006B0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x6B0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_50           ((uint32_t)0x006C0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x6C0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_51           ((uint32_t)0x006D0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x6D0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UC_52           ((uint32_t)0x006E0002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x6E0002</tt> */
#define MXC_R_AFE_ADC_ZERO_UCADDR          ((uint32_t)0x006F0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x6F0001</tt> */
#define MXC_R_AFE_ADC_ZERO_FT_PWORD        ((uint32_t)0x00700001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x700001</tt> */
#define MXC_R_AFE_ADC_ZERO_ADC_TRIM0       ((uint32_t)0x00770003UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x770003</tt> */
#define MXC_R_AFE_ADC_ZERO_ADC_TRIM1       ((uint32_t)0x00780002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x780002</tt> */
#define MXC_R_AFE_ADC_ZERO_ANA_TRIM        ((uint32_t)0x00790002UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x790002</tt> */
#define MXC_R_AFE_ADC_ZERO_SYS_CTRL        ((uint32_t)0x007A0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x7A0001</tt> */
#define MXC_R_AFE_ADC_ZERO_TS_CTRL         ((uint32_t)0x007C0001UL) /**< Offset from AFE_ADC_ZERO Base Address: <tt> 0x7C0001</tt> */
/**@} end of group afe_adc_zero_registers */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_PD AFE_ADC_ZERO_PD
 * @brief    Power down
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_PD_PD_POS                   0 /**< PD_PD Position */
#define MXC_F_AFE_ADC_ZERO_PD_PD                       ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ZERO_PD_PD_POS)) /**< PD_PD Mask */
#define MXC_V_AFE_ADC_ZERO_PD_PD_NORMAL_MODE           ((uint8_t)0x0UL) /**< PD_PD_NORMAL_MODE Value */
#define MXC_S_AFE_ADC_ZERO_PD_PD_NORMAL_MODE           (MXC_V_AFE_ADC_ZERO_PD_PD_NORMAL_MODE << MXC_F_AFE_ADC_ZERO_PD_PD_POS) /**< PD_PD_NORMAL_MODE Setting */
#define MXC_V_AFE_ADC_ZERO_PD_PD_STANDBY_MODE          ((uint8_t)0x1UL) /**< PD_PD_STANDBY_MODE Value */
#define MXC_S_AFE_ADC_ZERO_PD_PD_STANDBY_MODE          (MXC_V_AFE_ADC_ZERO_PD_PD_STANDBY_MODE << MXC_F_AFE_ADC_ZERO_PD_PD_POS) /**< PD_PD_STANDBY_MODE Setting */
#define MXC_V_AFE_ADC_ZERO_PD_PD_SLEEP_MODE            ((uint8_t)0x2UL) /**< PD_PD_SLEEP_MODE Value */
#define MXC_S_AFE_ADC_ZERO_PD_PD_SLEEP_MODE            (MXC_V_AFE_ADC_ZERO_PD_PD_SLEEP_MODE << MXC_F_AFE_ADC_ZERO_PD_PD_POS) /**< PD_PD_SLEEP_MODE Setting */
#define MXC_V_AFE_ADC_ZERO_PD_PD_RESET                 ((uint8_t)0x3UL) /**< PD_PD_RESET Value */
#define MXC_S_AFE_ADC_ZERO_PD_PD_RESET                 (MXC_V_AFE_ADC_ZERO_PD_PD_RESET << MXC_F_AFE_ADC_ZERO_PD_PD_POS) /**< PD_PD_RESET Setting */

/**@} end of group AFE_ADC_ZERO_PD_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_CONV_START AFE_ADC_ZERO_CONV_START
 * @brief    Initiate conversions
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_CONV_START_CONV_TYPE_POS    0 /**< CONV_START_CONV_TYPE Position */
#define MXC_F_AFE_ADC_ZERO_CONV_START_CONV_TYPE        ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ZERO_CONV_START_CONV_TYPE_POS)) /**< CONV_START_CONV_TYPE Mask */
#define MXC_V_AFE_ADC_ZERO_CONV_START_CONV_TYPE_SINGLE ((uint8_t)0x0UL) /**< CONV_START_CONV_TYPE_SINGLE Value */
#define MXC_S_AFE_ADC_ZERO_CONV_START_CONV_TYPE_SINGLE (MXC_V_AFE_ADC_ZERO_CONV_START_CONV_TYPE_SINGLE << MXC_F_AFE_ADC_ZERO_CONV_START_CONV_TYPE_POS) /**< CONV_START_CONV_TYPE_SINGLE Setting */
#define MXC_V_AFE_ADC_ZERO_CONV_START_CONV_TYPE_CONTINUOUS ((uint8_t)0x1UL) /**< CONV_START_CONV_TYPE_CONTINUOUS Value */
#define MXC_S_AFE_ADC_ZERO_CONV_START_CONV_TYPE_CONTINUOUS (MXC_V_AFE_ADC_ZERO_CONV_START_CONV_TYPE_CONTINUOUS << MXC_F_AFE_ADC_ZERO_CONV_START_CONV_TYPE_POS) /**< CONV_START_CONV_TYPE_CONTINUOUS Setting */
#define MXC_V_AFE_ADC_ZERO_CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 ((uint8_t)0x2UL) /**< CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 Value */
#define MXC_S_AFE_ADC_ZERO_CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 (MXC_V_AFE_ADC_ZERO_CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 << MXC_F_AFE_ADC_ZERO_CONV_START_CONV_TYPE_POS) /**< CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 Setting */

#define MXC_F_AFE_ADC_ZERO_CONV_START_DEST_POS         4 /**< CONV_START_DEST Position */
#define MXC_F_AFE_ADC_ZERO_CONV_START_DEST             ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ZERO_CONV_START_DEST_POS)) /**< CONV_START_DEST Mask */

/**@} end of group AFE_ADC_ZERO_CONV_START_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SEQ_START AFE_ADC_ZERO_SEQ_START
 * @brief    Execute a sequence at written address (0x3A to 0x6E)
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SEQ_START_SEQ_ADDRESS_POS   0 /**< SEQ_START_SEQ_ADDRESS Position */
#define MXC_F_AFE_ADC_ZERO_SEQ_START_SEQ_ADDRESS       ((uint8_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_SEQ_START_SEQ_ADDRESS_POS)) /**< SEQ_START_SEQ_ADDRESS Mask */

/**@} end of group AFE_ADC_ZERO_SEQ_START_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_CAL_START AFE_ADC_ZERO_CAL_START
 * @brief    Execute selected calibration
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_CAL_START_CAL_TYPE_POS      0 /**< CAL_START_CAL_TYPE Position */
#define MXC_F_AFE_ADC_ZERO_CAL_START_CAL_TYPE          ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ZERO_CAL_START_CAL_TYPE_POS)) /**< CAL_START_CAL_TYPE Mask */

/**@} end of group AFE_ADC_ZERO_CAL_START_Register */

