analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_zero_regs.h
#define MXC_F_AFE_ADC_ZERO_CTRL_FORMAT_POS             5 /**< CTRL_FORMAT Position */
#define MXC_F_AFE_ADC_ZERO_CTRL_FORMAT                 ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_CTRL_FORMAT_POS)) /**< CTRL_FORMAT Mask */

#define MXC_F_AFE_ADC_ZERO_CTRL_U_BN_POS               6 /**< CTRL_U_BN Position */
#define MXC_F_AFE_ADC_ZERO_CTRL_U_BN                   ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_CTRL_U_BN_POS)) /**< CTRL_U_BN Mask */

#define MXC_F_AFE_ADC_ZERO_CTRL_EXTCLK_POS             7 /**< CTRL_EXTCLK Position */
#define MXC_F_AFE_ADC_ZERO_CTRL_EXTCLK                 ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_CTRL_EXTCLK_POS)) /**< CTRL_EXTCLK Mask */

/**@} end of group AFE_ADC_ZERO_CTRL_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SOURCE AFE_ADC_ZERO_SOURCE
 * @brief    Configures excitation current, burnout current, and bias voltage sources.
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS        0 /**< SOURCE_IDAC_MODE Position */
#define MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE            ((uint8_t)(0xFUL << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS)) /**< SOURCE_IDAC_MODE Mask */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_10UA   ((uint8_t)0x0UL) /**< SOURCE_IDAC_MODE_CUR_10UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_10UA   (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_10UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_10UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_50UA   ((uint8_t)0x1UL) /**< SOURCE_IDAC_MODE_CUR_50UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_50UA   (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_50UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_50UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_75UA   ((uint8_t)0x2UL) /**< SOURCE_IDAC_MODE_CUR_75UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_75UA   (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_75UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_75UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_100UA  ((uint8_t)0x3UL) /**< SOURCE_IDAC_MODE_CUR_100UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_100UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_100UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_100UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_125UA  ((uint8_t)0x4UL) /**< SOURCE_IDAC_MODE_CUR_125UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_125UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_125UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_125UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_150UA  ((uint8_t)0x5UL) /**< SOURCE_IDAC_MODE_CUR_150UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_150UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_150UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_150UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_175UA  ((uint8_t)0x6UL) /**< SOURCE_IDAC_MODE_CUR_175UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_175UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_175UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_175UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_200UA  ((uint8_t)0x7UL) /**< SOURCE_IDAC_MODE_CUR_200UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_200UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_200UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_200UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_225UA  ((uint8_t)0x8UL) /**< SOURCE_IDAC_MODE_CUR_225UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_225UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_225UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_225UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_250UA  ((uint8_t)0x9UL) /**< SOURCE_IDAC_MODE_CUR_250UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_250UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_250UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_250UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_300UA  ((uint8_t)0xAUL) /**< SOURCE_IDAC_MODE_CUR_300UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_300UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_300UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_300UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_400UA  ((uint8_t)0xBUL) /**< SOURCE_IDAC_MODE_CUR_400UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_400UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_400UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_400UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_600UA  ((uint8_t)0xCUL) /**< SOURCE_IDAC_MODE_CUR_600UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_600UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_600UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_600UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_800UA  ((uint8_t)0xDUL) /**< SOURCE_IDAC_MODE_CUR_800UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_800UA  (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_800UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_800UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_1200UA ((uint8_t)0xEUL) /**< SOURCE_IDAC_MODE_CUR_1200UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_1200UA (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_1200UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_1200UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_1600UA ((uint8_t)0xFUL) /**< SOURCE_IDAC_MODE_CUR_1600UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_1600UA (MXC_V_AFE_ADC_ZERO_SOURCE_IDAC_MODE_CUR_1600UA << MXC_F_AFE_ADC_ZERO_SOURCE_IDAC_MODE_POS) /**< SOURCE_IDAC_MODE_CUR_1600UA Setting */

#define MXC_F_AFE_ADC_ZERO_SOURCE_BRN_MODE_POS         4 /**< SOURCE_BRN_MODE Position */
#define MXC_F_AFE_ADC_ZERO_SOURCE_BRN_MODE             ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SOURCE_BRN_MODE_POS)) /**< SOURCE_BRN_MODE Mask */
#define MXC_V_AFE_ADC_ZERO_SOURCE_BRN_MODE_POW_DOWN_CUR_SRC_DISABLED ((uint8_t)0x0UL) /**< SOURCE_BRN_MODE_POW_DOWN_CUR_SRC_DISABLED Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_BRN_MODE_POW_DOWN_CUR_SRC_DISABLED (MXC_V_AFE_ADC_ZERO_SOURCE_BRN_MODE_POW_DOWN_CUR_SRC_DISABLED << MXC_F_AFE_ADC_ZERO_SOURCE_BRN_MODE_POS) /**< SOURCE_BRN_MODE_POW_DOWN_CUR_SRC_DISABLED Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_0_5UA ((uint8_t)0x1UL) /**< SOURCE_BRN_MODE_CUR_SRC_0_5UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_0_5UA (MXC_V_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_0_5UA << MXC_F_AFE_ADC_ZERO_SOURCE_BRN_MODE_POS) /**< SOURCE_BRN_MODE_CUR_SRC_0_5UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_1UA ((uint8_t)0x2UL) /**< SOURCE_BRN_MODE_CUR_SRC_1UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_1UA (MXC_V_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_1UA << MXC_F_AFE_ADC_ZERO_SOURCE_BRN_MODE_POS) /**< SOURCE_BRN_MODE_CUR_SRC_1UA Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_10_UA ((uint8_t)0x3UL) /**< SOURCE_BRN_MODE_CUR_SRC_10_UA Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_10_UA (MXC_V_AFE_ADC_ZERO_SOURCE_BRN_MODE_CUR_SRC_10_UA << MXC_F_AFE_ADC_ZERO_SOURCE_BRN_MODE_POS) /**< SOURCE_BRN_MODE_CUR_SRC_10_UA Setting */

