analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_zero_regs.h
#define MXC_F_AFE_ADC_ZERO_PGA_SIG_PATH_POS            4 /**< PGA_SIG_PATH Position */
#define MXC_F_AFE_ADC_ZERO_PGA_SIG_PATH                ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ZERO_PGA_SIG_PATH_POS)) /**< PGA_SIG_PATH Mask */
#define MXC_V_AFE_ADC_ZERO_PGA_SIG_PATH_BUFFERED_UNITY_GAIN_PATH ((uint8_t)0x0UL) /**< PGA_SIG_PATH_BUFFERED_UNITY_GAIN_PATH Value */
#define MXC_S_AFE_ADC_ZERO_PGA_SIG_PATH_BUFFERED_UNITY_GAIN_PATH (MXC_V_AFE_ADC_ZERO_PGA_SIG_PATH_BUFFERED_UNITY_GAIN_PATH << MXC_F_AFE_ADC_ZERO_PGA_SIG_PATH_POS) /**< PGA_SIG_PATH_BUFFERED_UNITY_GAIN_PATH Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_SIG_PATH_BYPASS_PATH    ((uint8_t)0x1UL) /**< PGA_SIG_PATH_BYPASS_PATH Value */
#define MXC_S_AFE_ADC_ZERO_PGA_SIG_PATH_BYPASS_PATH    (MXC_V_AFE_ADC_ZERO_PGA_SIG_PATH_BYPASS_PATH << MXC_F_AFE_ADC_ZERO_PGA_SIG_PATH_POS) /**< PGA_SIG_PATH_BYPASS_PATH Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_SIG_PATH_PGA_PATH       ((uint8_t)0x2UL) /**< PGA_SIG_PATH_PGA_PATH Value */
#define MXC_S_AFE_ADC_ZERO_PGA_SIG_PATH_PGA_PATH       (MXC_V_AFE_ADC_ZERO_PGA_SIG_PATH_PGA_PATH << MXC_F_AFE_ADC_ZERO_PGA_SIG_PATH_POS) /**< PGA_SIG_PATH_PGA_PATH Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_SIG_PATH_RESERVED       ((uint8_t)0x3UL) /**< PGA_SIG_PATH_RESERVED Value */
#define MXC_S_AFE_ADC_ZERO_PGA_SIG_PATH_RESERVED       (MXC_V_AFE_ADC_ZERO_PGA_SIG_PATH_RESERVED << MXC_F_AFE_ADC_ZERO_PGA_SIG_PATH_POS) /**< PGA_SIG_PATH_RESERVED Setting */

/**@} end of group AFE_ADC_ZERO_PGA_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_WAIT_EXT AFE_ADC_ZERO_WAIT_EXT
 * @brief    Extends count range of WAIT command
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_WAIT_EXT_WAIT_EXT_POS       0 /**< WAIT_EXT_WAIT_EXT Position */
#define MXC_F_AFE_ADC_ZERO_WAIT_EXT_WAIT_EXT           ((uint8_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_WAIT_EXT_WAIT_EXT_POS)) /**< WAIT_EXT_WAIT_EXT Mask */

/**@} end of group AFE_ADC_ZERO_WAIT_EXT_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_PART_ID AFE_ADC_ZERO_PART_ID
 * @brief    Silicon Revision ID
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_PART_ID_REV_ID_POS          0 /**< PART_ID_REV_ID Position */
#define MXC_F_AFE_ADC_ZERO_PART_ID_REV_ID              ((uint32_t)(0x7UL << MXC_F_AFE_ADC_ZERO_PART_ID_REV_ID_POS)) /**< PART_ID_REV_ID Mask */

/**@} end of group AFE_ADC_ZERO_PART_ID_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SYSC_SEL AFE_ADC_ZERO_SYSC_SEL
 * @brief    System Calibration Selection
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_0_POS     0 /**< SYSC_SEL_SYSC_SEL_0 Position */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_0         ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_0_POS)) /**< SYSC_SEL_SYSC_SEL_0 Mask */

#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_1_POS     2 /**< SYSC_SEL_SYSC_SEL_1 Position */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_1         ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_1_POS)) /**< SYSC_SEL_SYSC_SEL_1 Mask */

#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_2_POS     4 /**< SYSC_SEL_SYSC_SEL_2 Position */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_2         ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_2_POS)) /**< SYSC_SEL_SYSC_SEL_2 Mask */

#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_3_POS     6 /**< SYSC_SEL_SYSC_SEL_3 Position */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_3         ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_3_POS)) /**< SYSC_SEL_SYSC_SEL_3 Mask */

#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_4_POS     8 /**< SYSC_SEL_SYSC_SEL_4 Position */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_4         ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_4_POS)) /**< SYSC_SEL_SYSC_SEL_4 Mask */

#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_5_POS     10 /**< SYSC_SEL_SYSC_SEL_5 Position */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_5         ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_5_POS)) /**< SYSC_SEL_SYSC_SEL_5 Mask */

#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_6_POS     12 /**< SYSC_SEL_SYSC_SEL_6 Position */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_6         ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_6_POS)) /**< SYSC_SEL_SYSC_SEL_6 Mask */

#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_7_POS     14 /**< SYSC_SEL_SYSC_SEL_7 Position */
#define MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_7         ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYSC_SEL_SYSC_SEL_7_POS)) /**< SYSC_SEL_SYSC_SEL_7 Mask */

/**@} end of group AFE_ADC_ZERO_SYSC_SEL_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SYS_OFF_A AFE_ADC_ZERO_SYS_OFF_A
 * @brief    System offset A calibration value to subtract from conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SYS_OFF_A_SYS_OFF_A_POS     0 /**< SYS_OFF_A_SYS_OFF_A Position */
#define MXC_F_AFE_ADC_ZERO_SYS_OFF_A_SYS_OFF_A         ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SYS_OFF_A_SYS_OFF_A_POS)) /**< SYS_OFF_A_SYS_OFF_A Mask */

/**@} end of group AFE_ADC_ZERO_SYS_OFF_A_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SYS_OFF_B AFE_ADC_ZERO_SYS_OFF_B
 * @brief    System offset B calibration value to subtract from conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SYS_OFF_B_SYS_OFF_B_POS     0 /**< SYS_OFF_B_SYS_OFF_B Position */
#define MXC_F_AFE_ADC_ZERO_SYS_OFF_B_SYS_OFF_B         ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SYS_OFF_B_SYS_OFF_B_POS)) /**< SYS_OFF_B_SYS_OFF_B Mask */

/**@} end of group AFE_ADC_ZERO_SYS_OFF_B_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SYS_GAIN_A AFE_ADC_ZERO_SYS_GAIN_A
 * @brief    System gain calibration A value to scale offset corrected conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SYS_GAIN_A_SYS_GAIN_A_POS   0 /**< SYS_GAIN_A_SYS_GAIN_A Position */
#define MXC_F_AFE_ADC_ZERO_SYS_GAIN_A_SYS_GAIN_A       ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SYS_GAIN_A_SYS_GAIN_A_POS)) /**< SYS_GAIN_A_SYS_GAIN_A Mask */

/**@} end of group AFE_ADC_ZERO_SYS_GAIN_A_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SYS_GAIN_B AFE_ADC_ZERO_SYS_GAIN_B
 * @brief    System gain calibration B value to scale offset corrected conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SYS_GAIN_B_SYS_GAIN_B_POS   0 /**< SYS_GAIN_B_SYS_GAIN_B Position */
#define MXC_F_AFE_ADC_ZERO_SYS_GAIN_B_SYS_GAIN_B       ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SYS_GAIN_B_SYS_GAIN_B_POS)) /**< SYS_GAIN_B_SYS_GAIN_B Mask */

