analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_zero_regs.h
/**@} end of group AFE_ADC_ZERO_LTHRESH2_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_LTHRESH3 AFE_ADC_ZERO_LTHRESH3
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_LTHRESH3_LTHRESH_POS        0 /**< LTHRESH3_LTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_LTHRESH3_LTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_LTHRESH3_LTHRESH_POS)) /**< LTHRESH3_LTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_LTHRESH3_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_LTHRESH4 AFE_ADC_ZERO_LTHRESH4
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_LTHRESH4_LTHRESH_POS        0 /**< LTHRESH4_LTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_LTHRESH4_LTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_LTHRESH4_LTHRESH_POS)) /**< LTHRESH4_LTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_LTHRESH4_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_LTHRESH5 AFE_ADC_ZERO_LTHRESH5
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_LTHRESH5_LTHRESH_POS        0 /**< LTHRESH5_LTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_LTHRESH5_LTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_LTHRESH5_LTHRESH_POS)) /**< LTHRESH5_LTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_LTHRESH5_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_LTHRESH6 AFE_ADC_ZERO_LTHRESH6
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_LTHRESH6_LTHRESH_POS        0 /**< LTHRESH6_LTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_LTHRESH6_LTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_LTHRESH6_LTHRESH_POS)) /**< LTHRESH6_LTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_LTHRESH6_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_LTHRESH7 AFE_ADC_ZERO_LTHRESH7
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_LTHRESH7_LTHRESH_POS        0 /**< LTHRESH7_LTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_LTHRESH7_LTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_LTHRESH7_LTHRESH_POS)) /**< LTHRESH7_LTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_LTHRESH7_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UTHRESH0 AFE_ADC_ZERO_UTHRESH0
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UTHRESH0_UTHRESH_POS        0 /**< UTHRESH0_UTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_UTHRESH0_UTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_UTHRESH0_UTHRESH_POS)) /**< UTHRESH0_UTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_UTHRESH0_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UTHRESH1 AFE_ADC_ZERO_UTHRESH1
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UTHRESH1_UTHRESH_POS        0 /**< UTHRESH1_UTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_UTHRESH1_UTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_UTHRESH1_UTHRESH_POS)) /**< UTHRESH1_UTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_UTHRESH1_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UTHRESH2 AFE_ADC_ZERO_UTHRESH2
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UTHRESH2_UTHRESH_POS        0 /**< UTHRESH2_UTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_UTHRESH2_UTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_UTHRESH2_UTHRESH_POS)) /**< UTHRESH2_UTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_UTHRESH2_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UTHRESH3 AFE_ADC_ZERO_UTHRESH3
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UTHRESH3_UTHRESH_POS        0 /**< UTHRESH3_UTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_UTHRESH3_UTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_UTHRESH3_UTHRESH_POS)) /**< UTHRESH3_UTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_UTHRESH3_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UTHRESH4 AFE_ADC_ZERO_UTHRESH4
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UTHRESH4_UTHRESH_POS        0 /**< UTHRESH4_UTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_UTHRESH4_UTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_UTHRESH4_UTHRESH_POS)) /**< UTHRESH4_UTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_UTHRESH4_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UTHRESH5 AFE_ADC_ZERO_UTHRESH5
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UTHRESH5_UTHRESH_POS        0 /**< UTHRESH5_UTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_UTHRESH5_UTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_UTHRESH5_UTHRESH_POS)) /**< UTHRESH5_UTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_UTHRESH5_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UTHRESH6 AFE_ADC_ZERO_UTHRESH6
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UTHRESH6_UTHRESH_POS        0 /**< UTHRESH6_UTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_UTHRESH6_UTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_UTHRESH6_UTHRESH_POS)) /**< UTHRESH6_UTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_UTHRESH6_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UTHRESH7 AFE_ADC_ZERO_UTHRESH7
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UTHRESH7_UTHRESH_POS        0 /**< UTHRESH7_UTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_UTHRESH7_UTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_UTHRESH7_UTHRESH_POS)) /**< UTHRESH7_UTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_UTHRESH7_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_DATA0 AFE_ADC_ZERO_DATA0
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_DATA0_DATA0_POS             0 /**< DATA0_DATA0 Position */
#define MXC_F_AFE_ADC_ZERO_DATA0_DATA0                 ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_DATA0_DATA0_POS)) /**< DATA0_DATA0 Mask */

/**@} end of group AFE_ADC_ZERO_DATA0_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_DATA1 AFE_ADC_ZERO_DATA1
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_DATA1_DATA1_POS             0 /**< DATA1_DATA1 Position */
#define MXC_F_AFE_ADC_ZERO_DATA1_DATA1                 ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_DATA1_DATA1_POS)) /**< DATA1_DATA1 Mask */

/**@} end of group AFE_ADC_ZERO_DATA1_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_DATA2 AFE_ADC_ZERO_DATA2
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_DATA2_DATA2_POS             0 /**< DATA2_DATA2 Position */
#define MXC_F_AFE_ADC_ZERO_DATA2_DATA2                 ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_DATA2_DATA2_POS)) /**< DATA2_DATA2 Mask */

/**@} end of group AFE_ADC_ZERO_DATA2_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_DATA3 AFE_ADC_ZERO_DATA3
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_DATA3_DATA3_POS             0 /**< DATA3_DATA3 Position */
#define MXC_F_AFE_ADC_ZERO_DATA3_DATA3                 ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_DATA3_DATA3_POS)) /**< DATA3_DATA3 Mask */

