analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_zero_regs.h
/**@} end of group AFE_ADC_ZERO_DATA3_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_DATA4 AFE_ADC_ZERO_DATA4
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_DATA4_DATA4_POS             0 /**< DATA4_DATA4 Position */
#define MXC_F_AFE_ADC_ZERO_DATA4_DATA4                 ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_DATA4_DATA4_POS)) /**< DATA4_DATA4 Mask */

/**@} end of group AFE_ADC_ZERO_DATA4_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_DATA5 AFE_ADC_ZERO_DATA5
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_DATA5_DATA5_POS             0 /**< DATA5_DATA5 Position */
#define MXC_F_AFE_ADC_ZERO_DATA5_DATA5                 ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_DATA5_DATA5_POS)) /**< DATA5_DATA5 Mask */

/**@} end of group AFE_ADC_ZERO_DATA5_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_DATA6 AFE_ADC_ZERO_DATA6
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_DATA6_DATA6_POS             0 /**< DATA6_DATA6 Position */
#define MXC_F_AFE_ADC_ZERO_DATA6_DATA6                 ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_DATA6_DATA6_POS)) /**< DATA6_DATA6 Mask */

/**@} end of group AFE_ADC_ZERO_DATA6_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_DATA7 AFE_ADC_ZERO_DATA7
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_DATA7_DATA7_POS             0 /**< DATA7_DATA7 Position */
#define MXC_F_AFE_ADC_ZERO_DATA7_DATA7                 ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_DATA7_DATA7_POS)) /**< DATA7_DATA7 Mask */

/**@} end of group AFE_ADC_ZERO_DATA7_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_STATUS AFE_ADC_ZERO_STATUS
 * @brief    Device Status, INTB source etc.
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_STATUS_CONV_RDY_POS         0 /**< STATUS_CONV_RDY Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_CONV_RDY             ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_CONV_RDY_POS)) /**< STATUS_CONV_RDY Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_SEQ_RDY_POS          1 /**< STATUS_SEQ_RDY Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_SEQ_RDY              ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_SEQ_RDY_POS)) /**< STATUS_SEQ_RDY Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_CAL_RDY_POS          2 /**< STATUS_CAL_RDY Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_CAL_RDY              ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_CAL_RDY_POS)) /**< STATUS_CAL_RDY Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_WAIT_DONE_POS        3 /**< STATUS_WAIT_DONE Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_WAIT_DONE            ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_WAIT_DONE_POS)) /**< STATUS_WAIT_DONE Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_DATA_RDY_POS         4 /**< STATUS_DATA_RDY Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_DATA_RDY             ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_DATA_RDY_POS)) /**< STATUS_DATA_RDY Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_SYSGOR_POS           7 /**< STATUS_SYSGOR Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_SYSGOR               ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_SYSGOR_POS)) /**< STATUS_SYSGOR Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_0_POS            8 /**< STATUS_TUR_0 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_0                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TUR_0_POS)) /**< STATUS_TUR_0 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_1_POS            9 /**< STATUS_TUR_1 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_1                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TUR_1_POS)) /**< STATUS_TUR_1 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_2_POS            10 /**< STATUS_TUR_2 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_2                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TUR_2_POS)) /**< STATUS_TUR_2 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_3_POS            11 /**< STATUS_TUR_3 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_3                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TUR_3_POS)) /**< STATUS_TUR_3 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_4_POS            12 /**< STATUS_TUR_4 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_4                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TUR_4_POS)) /**< STATUS_TUR_4 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_5_POS            13 /**< STATUS_TUR_5 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_5                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TUR_5_POS)) /**< STATUS_TUR_5 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_6_POS            14 /**< STATUS_TUR_6 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_6                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TUR_6_POS)) /**< STATUS_TUR_6 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_7_POS            15 /**< STATUS_TUR_7 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TUR_7                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TUR_7_POS)) /**< STATUS_TUR_7 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_0_POS            16 /**< STATUS_TOR_0 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_0                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TOR_0_POS)) /**< STATUS_TOR_0 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_1_POS            17 /**< STATUS_TOR_1 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_1                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TOR_1_POS)) /**< STATUS_TOR_1 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_2_POS            18 /**< STATUS_TOR_2 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_2                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TOR_2_POS)) /**< STATUS_TOR_2 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_3_POS            19 /**< STATUS_TOR_3 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_3                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TOR_3_POS)) /**< STATUS_TOR_3 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_4_POS            20 /**< STATUS_TOR_4 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_4                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TOR_4_POS)) /**< STATUS_TOR_4 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_5_POS            21 /**< STATUS_TOR_5 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_5                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TOR_5_POS)) /**< STATUS_TOR_5 Mask */

#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_6_POS            22 /**< STATUS_TOR_6 Position */
#define MXC_F_AFE_ADC_ZERO_STATUS_TOR_6                ((uint32_t)(0x1UL << MXC_F_AFE_ADC_ZERO_STATUS_TOR_6_POS)) /**< STATUS_TOR_6 Mask */

