analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_zero_regs.h
#define MXC_F_AFE_ADC_ZERO_UC_51_REG_ADDR_POS          8 /**< UC_51_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_51_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_51_REG_ADDR_POS)) /**< UC_51_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_51_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_52 AFE_ADC_ZERO_UC_52
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_52_REG_DATA_POS          0 /**< UC_52_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_52_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_52_REG_DATA_POS)) /**< UC_52_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_52_REG_ADDR_POS          8 /**< UC_52_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_52_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_52_REG_ADDR_POS)) /**< UC_52_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_52_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UCADDR AFE_ADC_ZERO_UCADDR
 * @brief    Address of currently executing sequence command
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UCADDR_UCADDR_POS           0 /**< UCADDR_UCADDR Position */
#define MXC_F_AFE_ADC_ZERO_UCADDR_UCADDR               ((uint8_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UCADDR_UCADDR_POS)) /**< UCADDR_UCADDR Mask */

/**@} end of group AFE_ADC_ZERO_UCADDR_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_FT_PWORD AFE_ADC_ZERO_FT_PWORD
 * @brief    FT Password
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_POS       0 /**< FT_PWORD_FT_PWORD Position */
#define MXC_F_AFE_ADC_ZERO_FT_PWORD_FT_PWORD           ((uint8_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_POS)) /**< FT_PWORD_FT_PWORD Mask */
#define MXC_V_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_PWORD_1   ((uint8_t)0x48UL) /**< FT_PWORD_FT_PWORD_PWORD_1 Value */
#define MXC_S_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_PWORD_1   (MXC_V_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_PWORD_1 << MXC_F_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_POS) /**< FT_PWORD_FT_PWORD_PWORD_1 Setting */
#define MXC_V_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_PWORD_2   ((uint8_t)0x7BUL) /**< FT_PWORD_FT_PWORD_PWORD_2 Value */
#define MXC_S_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_PWORD_2   (MXC_V_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_PWORD_2 << MXC_F_AFE_ADC_ZERO_FT_PWORD_FT_PWORD_POS) /**< FT_PWORD_FT_PWORD_PWORD_2 Setting */

/**@} end of group AFE_ADC_ZERO_FT_PWORD_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_ADC_TRIM0 AFE_ADC_ZERO_ADC_TRIM0
 * @brief    Various ADC Analog Trims
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_ADC_TRIM0_VGB_TRIM_POS      0 /**< ADC_TRIM0_VGB_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ADC_TRIM0_VGB_TRIM          ((uint32_t)(0x3FUL << MXC_F_AFE_ADC_ZERO_ADC_TRIM0_VGB_TRIM_POS)) /**< ADC_TRIM0_VGB_TRIM Mask */

#define MXC_F_AFE_ADC_ZERO_ADC_TRIM0_IP_TRIM_POS       6 /**< ADC_TRIM0_IP_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ADC_TRIM0_IP_TRIM           ((uint32_t)(0x1FUL << MXC_F_AFE_ADC_ZERO_ADC_TRIM0_IP_TRIM_POS)) /**< ADC_TRIM0_IP_TRIM Mask */

#define MXC_F_AFE_ADC_ZERO_ADC_TRIM0_IB_TRIM_POS       11 /**< ADC_TRIM0_IB_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ADC_TRIM0_IB_TRIM           ((uint32_t)(0x3FUL << MXC_F_AFE_ADC_ZERO_ADC_TRIM0_IB_TRIM_POS)) /**< ADC_TRIM0_IB_TRIM Mask */

#define MXC_F_AFE_ADC_ZERO_ADC_TRIM0_CLKSKEW_POS       17 /**< ADC_TRIM0_CLKSKEW Position */
#define MXC_F_AFE_ADC_ZERO_ADC_TRIM0_CLKSKEW           ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ZERO_ADC_TRIM0_CLKSKEW_POS)) /**< ADC_TRIM0_CLKSKEW Mask */

/**@} end of group AFE_ADC_ZERO_ADC_TRIM0_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_ADC_TRIM1 AFE_ADC_ZERO_ADC_TRIM1
 * @brief    Various ADC Analog Trims
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_ADC_TRIM1_IDAC0_TRIM_POS    0 /**< ADC_TRIM1_IDAC0_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ADC_TRIM1_IDAC0_TRIM        ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_ADC_TRIM1_IDAC0_TRIM_POS)) /**< ADC_TRIM1_IDAC0_TRIM Mask */

#define MXC_F_AFE_ADC_ZERO_ADC_TRIM1_IDAC1_TRIM_POS    7 /**< ADC_TRIM1_IDAC1_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ADC_TRIM1_IDAC1_TRIM        ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_ADC_TRIM1_IDAC1_TRIM_POS)) /**< ADC_TRIM1_IDAC1_TRIM Mask */

/**@} end of group AFE_ADC_ZERO_ADC_TRIM1_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_ANA_TRIM AFE_ADC_ZERO_ANA_TRIM
 * @brief    Various Analog Trims
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_LDO_TRIM_POS       0 /**< ANA_TRIM_LDO_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_LDO_TRIM           ((uint16_t)(0xFUL << MXC_F_AFE_ADC_ZERO_ANA_TRIM_LDO_TRIM_POS)) /**< ANA_TRIM_LDO_TRIM Mask */

#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_OSC_TRIM_POS       4 /**< ANA_TRIM_OSC_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_OSC_TRIM           ((uint16_t)(0x3FUL << MXC_F_AFE_ADC_ZERO_ANA_TRIM_OSC_TRIM_POS)) /**< ANA_TRIM_OSC_TRIM Mask */

#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_OSC_FSEL_POS       10 /**< ANA_TRIM_OSC_FSEL Position */
#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_OSC_FSEL           ((uint16_t)(0x3UL << MXC_F_AFE_ADC_ZERO_ANA_TRIM_OSC_FSEL_POS)) /**< ANA_TRIM_OSC_FSEL Mask */

#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_PKG_TRIM_POS       12 /**< ANA_TRIM_PKG_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_PKG_TRIM           ((uint16_t)(0x3UL << MXC_F_AFE_ADC_ZERO_ANA_TRIM_PKG_TRIM_POS)) /**< ANA_TRIM_PKG_TRIM Mask */

#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_RES_TRIM_POS       14 /**< ANA_TRIM_RES_TRIM Position */
#define MXC_F_AFE_ADC_ZERO_ANA_TRIM_RES_TRIM           ((uint16_t)(0x1UL << MXC_F_AFE_ADC_ZERO_ANA_TRIM_RES_TRIM_POS)) /**< ANA_TRIM_RES_TRIM Mask */

/**@} end of group AFE_ADC_ZERO_ANA_TRIM_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SYS_CTRL AFE_ADC_ZERO_SYS_CTRL
 * @brief    System Calibration Selection
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_POS    0 /**< SYS_CTRL_ANA_SRC_SEL Position */
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL        ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_POS)) /**< SYS_CTRL_ANA_SRC_SEL Mask */
#define MXC_V_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_ADC0_BANK ((uint8_t)0x0UL) /**< SYS_CTRL_ANA_SRC_SEL_ADC0_BANK Value */
#define MXC_S_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_ADC0_BANK (MXC_V_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_ADC0_BANK << MXC_F_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_POS) /**< SYS_CTRL_ANA_SRC_SEL_ADC0_BANK Setting */
#define MXC_V_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_ADC1_BANK ((uint8_t)0x1UL) /**< SYS_CTRL_ANA_SRC_SEL_ADC1_BANK Value */
#define MXC_S_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_ADC1_BANK (MXC_V_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_ADC1_BANK << MXC_F_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_POS) /**< SYS_CTRL_ANA_SRC_SEL_ADC1_BANK Setting */
#define MXC_V_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_DAC12_BANK ((uint8_t)0x2UL) /**< SYS_CTRL_ANA_SRC_SEL_DAC12_BANK Value */
#define MXC_S_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_DAC12_BANK (MXC_V_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_DAC12_BANK << MXC_F_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_POS) /**< SYS_CTRL_ANA_SRC_SEL_DAC12_BANK Setting */
#define MXC_V_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_HART_BANK ((uint8_t)0x3UL) /**< SYS_CTRL_ANA_SRC_SEL_HART_BANK Value */
#define MXC_S_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_HART_BANK (MXC_V_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_HART_BANK << MXC_F_AFE_ADC_ZERO_SYS_CTRL_ANA_SRC_SEL_POS) /**< SYS_CTRL_ANA_SRC_SEL_HART_BANK Setting */

#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_CRC5_POS           2 /**< SYS_CTRL_CRC5 Position */
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_CRC5               ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_SYS_CTRL_CRC5_POS)) /**< SYS_CTRL_CRC5 Mask */

#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_ST_DIS_POS         3 /**< SYS_CTRL_ST_DIS Position */
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_ST_DIS             ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_SYS_CTRL_ST_DIS_POS)) /**< SYS_CTRL_ST_DIS Mask */

