analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_zero_regs.h
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_HART_EN_POS        4 /**< SYS_CTRL_HART_EN Position */
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_HART_EN            ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_SYS_CTRL_HART_EN_POS)) /**< SYS_CTRL_HART_EN Mask */

#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_SPI_ABORT_DIS_POS  5 /**< SYS_CTRL_SPI_ABORT_DIS Position */
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_SPI_ABORT_DIS      ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_SYS_CTRL_SPI_ABORT_DIS_POS)) /**< SYS_CTRL_SPI_ABORT_DIS Mask */

#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_POR_FLAG_POS       6 /**< SYS_CTRL_POR_FLAG Position */
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_POR_FLAG           ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_SYS_CTRL_POR_FLAG_POS)) /**< SYS_CTRL_POR_FLAG Mask */

#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_CRC_INV_POS        7 /**< SYS_CTRL_CRC_INV Position */
#define MXC_F_AFE_ADC_ZERO_SYS_CTRL_CRC_INV            ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_SYS_CTRL_CRC_INV_POS)) /**< SYS_CTRL_CRC_INV Mask */

/**@} end of group AFE_ADC_ZERO_SYS_CTRL_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_TS_CTRL AFE_ADC_ZERO_TS_CTRL
 * @brief    Temperature Sensor Control
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_EN_POS           0 /**< TS_CTRL_TS_EN Position */
#define MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_EN               ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_EN_POS)) /**< TS_CTRL_TS_EN Mask */

#define MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_CONV_EN_POS      1 /**< TS_CTRL_TS_CONV_EN Position */
#define MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_CONV_EN          ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_CONV_EN_POS)) /**< TS_CTRL_TS_CONV_EN Mask */

#define MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_INTG_RDY_POS     2 /**< TS_CTRL_TS_INTG_RDY Position */
#define MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_INTG_RDY         ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_TS_CTRL_TS_INTG_RDY_POS)) /**< TS_CTRL_TS_INTG_RDY Mask */

/**@} end of group AFE_ADC_ZERO_TS_CTRL_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32680_INCLUDE_AFE_ADC_ZERO_REGS_H_
